diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/CommonForms/ВКМ_КалендарьСпециалистов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	ВКМ_Пларировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	ОбновитьПланировщик();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПланировщик()
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	Месяц = 2628000;
	
	ВКМ_Пларировщик.Элементы.Очистить();
	
	Заявки = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода - Месяц, КонецПериода + Месяц);
	
	Пока Заявки.Следующий() Цикл 
		
		НачалоЗаявки = Заявки.ВКМ_ДатаПроведенияРабот + (Заявки.ВКМ_ВремяНачалаРабот - Дата(1,1,1));
		КонецЗаявки = Заявки.ВКМ_ДатаПроведенияРабот + (Заявки.ВКМ_ВремяОкончанияРабот - Дата(1,1,1));
		
		ЭлементПланировщика = ВКМ_Пларировщик.Элементы.Добавить(НачалоЗаявки, КонецЗаявки);
		ЭлементПланировщика.Значение = Заявки.Ссылка;
		ЭлементПланировщика.Текст = Заявки.ВКМ_Специалист; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда) 
	
	ОбновитьПланировщик();     
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ПларировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура; 
	ЗначенияЗаполнения.Вставить("Дата", ТекущаяДата()); 
	ЗначенияЗаполнения.Вставить("ВКМ_ДатаПроведенияРабот", НачалоДня(Начало));
	ЗначенияЗаполнения.Вставить("ВКМ_ВремяНачалаРабот", Дата(1,1,1) + (Начало - НачалоДня(Начало))); 
	ЗначенияЗаполнения.Вставить("ВКМ_ВремяОкончанияРабот", Дата(1,1,1) + (Конец - НачалоДня(Конец)));
	ЗначенияЗаполнения.Вставить("ВКМ_Специалист", ПользователиКлиент.ТекущийПользователь());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВКМ_ОбслуживаниеКлиента" Тогда 
		ОбновитьПланировщик();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ПларировщикПриАктивизации(Элемент)  
	
	ДокСсылка = Элемент.ВыделенныеЭлементы[0].Значение; 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ДокСсылка);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры
